src/InformationRegisters/ЗаявкаСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЗаявкаСтатусы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/СтатусыЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СтатусыЗаявки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КадровыеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ЗаявкаСтатусы/Ext/ManagerModule.bsl
Функция УстановитьСтатус(Документ, Статус) Экспорт
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	Если Не Справочники.СтатусыЗаявки.ПроверитьДоступСтатуса(Статус, Пользователь) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запись = РегистрыСведений.ЗаявкаСтатусы.СоздатьМенеджерЗаписи();
	Запись.Период        = ТекущаяДата();
	Запись.ИдентификаторСтроки      = Документ;
	Запись.Статус        = Статус;
	Запись.Ответственный = Пользователь;
	Запись.ИмяКомпьютера = ИмяКомпьютера();
	
	Запись.Записать();
	
	Возврат Истина;
	
КонецФункции

Процедура АвтоматическийСтатус(Документ) Экспорт
	
	Статус = ПолучитьСтатус(Документ);
	
	Если Статус.Пустая() Тогда
		УстановитьСтатус(Документ, Справочники.СтатусыЗаявки.ПолучитьСтатусНачало());
	КонецЕсли;
	
	Если ПустаяСтрока(Статус.Заголовок) И Не Статус.Следующий.Пустая() Тогда
		УстановитьСтатус(Документ, Статус.Следующий);
	КонецЕсли;
	
КонецПроцедуры

Функция УстановитьПредыдущийСтатус(Документ) Экспорт
	
	Если ПолучитьСтатус(Документ) <> Справочники.СтатусыЗаявки.ПолучитьСтатусОтмена() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПредыдущийСтатус = РегистрыСведений.ЗаявкаСтатусы.ПолучитьПоследнее(ПолучитьДанные(Документ)[0].Период-1, Новый Структура("Документ", Документ)).Статус;
	
	УстановитьСтатус(Документ, ПредыдущийСтатус);
	
КонецФункции

Функция ПолучитьДанные(Документ) Экспорт
	
	Отбор = Новый Структура("Документ", Документ);
	
	Возврат РегистрыСведений.ЗаявкаСтатусы.СрезПоследних(, Отбор);
	
КонецФункции

Функция ПолучитьСтатус(Документ) Экспорт
	
	Отбор = Новый Структура("Документ", Документ);
	
	Возврат РегистрыСведений.ЗаявкаСтатусы.ПолучитьПоследнее(, Отбор).Статус;
	
КонецФункции

Процедура ПоказатьДанныеСтатуса(Колонки, ОформлениеСтроки, Документ) Экспорт
	
	Если Колонки.ДатаСтатуса.Видимость
	 Или Колонки.СтатусЗаявки.Видимость
	 Или Колонки.ОтветственныйЗаСтатус.Видимость Тогда
	 
	 	Данные = ПолучитьДанные(Документ);
		
		Если Данные.Количество()=0 Тогда
			Возврат;
		Иначе
			ДатаСтатуса   = Данные[0].Период;
			СтатусЗаявки  = Данные[0].Статус;
			Ответственный = Данные[0].Ответственный;
			Оформление = СтатусЗаявки.Оформление.Получить();
			Если Оформление <> Неопределено Тогда 
				ЗаполнитьЗначенияСвойств(ОформлениеСтроки, Оформление);
			КонецЕсли;
		КонецЕсли;
		
		Если Колонки.ДатаСтатуса.Видимость Тогда
			ОформлениеСтроки.Ячейки.ДатаСтатуса.УстановитьТекст(ДатаСтатуса);
		КонецЕсли;
		
		Если Колонки.СтатусЗаявки.Видимость Тогда
			ОформлениеСтроки.Ячейки.СтатусЗаявки.УстановитьТекст(СтатусЗаявки);
		КонецЕсли;
		
		Если Колонки.ОтветственныйЗаСтатус.Видимость Тогда
			ОформлениеСтроки.Ячейки.ОтветственныйЗаСтатус.УстановитьТекст(Ответственный);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьСтатусыЗаявки(Документ) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыЗаявок.Период КАК Дата,
	|	СтатусыЗаявок.Статус,
	|	СтатусыЗаявок.УдалитьСтатус,
	|	СтатусыЗаявок.Ответственный
	|ИЗ
	|	РегистрСведений.СтатусыЗаявок КАК СтатусыЗаявок
	|ГДЕ
	|	СтатусыЗаявок.Документ = &Документ"
	);
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Запрос.Выполнить().Выгрузить().ВыбратьСтроку("Статусы заявки "+Документ.Номер+" от "+Документ.Дата);
	
КонецПроцедуры
